[Timeout] BlockStatement
Code/metrics/src/index.ts:27:48
   constructor (options: Partial<Options> = {}) {
     this._client = require('prom-client')
 
-    if (typeof options.ignore !== 'undefined') {
-      this._ignore = options.ignore
-      this._ignore.push('/_metrics')
-      this._ignore.push('/favicon.ico')
-    } else {
+    if (typeof options.ignore !== 'undefined') {} else {
       this._ignore = ['/_metrics', '/favicon.ico']
     }

[Timeout] EqualityOperator
Code/metrics/src/index.ts:27:31
   constructor (options: Partial<Options> = {}) {
     this._client = require('prom-client')
 
-    if (typeof options.ignore !== 'undefined') {
+    if (typeof options.ignore === 'undefined') {
       this._ignore = options.ignore
       this._ignore.push('/_metrics')

[Timeout] StringLiteral
Code/metrics/src/index.ts:30:25
     if (typeof options.ignore !== 'undefined') {
       this._ignore = options.ignore
       this._ignore.push('/_metrics')
-      this._ignore.push('/favicon.ico')
+      this._ignore.push("")
     } else {
       this._ignore = ['/_metrics', '/favicon.ico']

[Timeout] BlockStatement
Code/metrics/src/index.ts:31:12
       this._ignore = options.ignore
       this._ignore.push('/_metrics')
       this._ignore.push('/favicon.ico')
-    } else {
-      this._ignore = ['/_metrics', '/favicon.ico']
-    }
+    } else {}
     if (typeof options.disableRouteCounter !== 'undefined') {
       this._disableRouteCounter = options.disableRouteCounter

[Killed] BooleanLiteral
Code/metrics/src/index.ts:37:35
     if (typeof options.disableRouteCounter !== 'undefined') {
       this._disableRouteCounter = options.disableRouteCounter
     } else {
-      this._disableRouteCounter = false
+      this._disableRouteCounter = true
     }
     if (typeof options.disableErrorCounter !== 'undefined') {

[Timeout] EqualityOperator
Code/metrics/src/index.ts:39:44
     } else {
       this._disableRouteCounter = false
     }
-    if (typeof options.disableErrorCounter !== 'undefined') {
+    if (typeof options.disableErrorCounter === 'undefined') {
       this._disableErrorCounter = options.disableErrorCounter
     } else {

[Timeout] BlockStatement
Code/metrics/src/index.ts:39:61
     } else {
       this._disableRouteCounter = false
     }
-    if (typeof options.disableErrorCounter !== 'undefined') {
-      this._disableErrorCounter = options.disableErrorCounter
-    } else {
+    if (typeof options.disableErrorCounter !== 'undefined') {} else {
       this._disableErrorCounter = false
     }

[Timeout] BooleanLiteral
Code/metrics/src/index.ts:42:35
     if (typeof options.disableErrorCounter !== 'undefined') {
       this._disableErrorCounter = options.disableErrorCounter
     } else {
-      this._disableErrorCounter = false
+      this._disableErrorCounter = true
     }
     if (typeof options.disableDurationCounter !== 'undefined') {

[Timeout] BlockStatement
Code/metrics/src/index.ts:44:64
     } else {
       this._disableErrorCounter = false
     }
-    if (typeof options.disableDurationCounter !== 'undefined') {
-      this._disableDurationCounter = options.disableDurationCounter
-    } else {
+    if (typeof options.disableDurationCounter !== 'undefined') {} else {
       this._disableDurationCounter = false
     }

[Timeout] ConditionalExpression
Code/metrics/src/index.ts:44:9
     } else {
       this._disableErrorCounter = false
     }
-    if (typeof options.disableDurationCounter !== 'undefined') {
+    if (false) {
       this._disableDurationCounter = options.disableDurationCounter
     } else {

[Killed] BooleanLiteral
Code/metrics/src/index.ts:47:38
     if (typeof options.disableDurationCounter !== 'undefined') {
       this._disableDurationCounter = options.disableDurationCounter
     } else {
-      this._disableDurationCounter = false
+      this._disableDurationCounter = true
     }
     if (typeof options.disableDefaultMetrics !== 'undefined') {

[Timeout] EqualityOperator
Code/metrics/src/index.ts:49:46
     } else {
       this._disableDurationCounter = false
     }
-    if (typeof options.disableDefaultMetrics !== 'undefined') {
+    if (typeof options.disableDefaultMetrics === 'undefined') {
       this._disableDefaultMetrics = options.disableDefaultMetrics
     } else {

[Timeout] ConditionalExpression
Code/metrics/src/index.ts:49:9
     } else {
       this._disableDurationCounter = false
     }
-    if (typeof options.disableDefaultMetrics !== 'undefined') {
+    if (false) {
       this._disableDefaultMetrics = options.disableDefaultMetrics
     } else {

[Killed] BooleanLiteral
Code/metrics/src/index.ts:52:37
     if (typeof options.disableDefaultMetrics !== 'undefined') {
       this._disableDefaultMetrics = options.disableDefaultMetrics
     } else {
-      this._disableDefaultMetrics = false
+      this._disableDefaultMetrics = true
     }
     if (!this._disableDefaultMetrics) {

[Killed] ConditionalExpression
Code/metrics/src/index.ts:54:9
     } else {
       this._disableDefaultMetrics = false
     }
-    if (!this._disableDefaultMetrics) {
+    if (false) {
       this._client._collectDefaultMetrics = this._client.collectDefaultMetrics
     }

[Killed] BooleanLiteral
Code/metrics/src/index.ts:54:9
     } else {
       this._disableDefaultMetrics = false
     }
-    if (!this._disableDefaultMetrics) {
+    if (this._disableDefaultMetrics) {
       this._client._collectDefaultMetrics = this._client.collectDefaultMetrics
     }

[Killed] ConditionalExpression
Code/metrics/src/index.ts:57:9
     if (!this._disableDefaultMetrics) {
       this._client._collectDefaultMetrics = this._client.collectDefaultMetrics
     }
-    if (!this._disableErrorCounter) {
+    if (false) {
       this._numOfErrors = new this._client.Counter({
         name: 'numOfErrors',

[Killed] BooleanLiteral
Code/metrics/src/index.ts:57:9
     if (!this._disableDefaultMetrics) {
       this._client._collectDefaultMetrics = this._client.collectDefaultMetrics
     }
-    if (!this._disableErrorCounter) {
+    if (this._disableErrorCounter) {
       this._numOfErrors = new this._client.Counter({
         name: 'numOfErrors',

[Killed] ObjectLiteral
Code/metrics/src/index.ts:58:52
       this._client._collectDefaultMetrics = this._client.collectDefaultMetrics
     }
     if (!this._disableErrorCounter) {
-      this._numOfErrors = new this._client.Counter({
-        name: 'numOfErrors',
-        help: 'Number of errors',
-        labelNames: ['error']
-      })
+      this._numOfErrors = new this._client.Counter({})
     }
     if (!this._disableRouteCounter) {

[Killed] StringLiteral
Code/metrics/src/index.ts:59:15
     }
     if (!this._disableErrorCounter) {
       this._numOfErrors = new this._client.Counter({
-        name: 'numOfErrors',
+        name: "",
         help: 'Number of errors',
         labelNames: ['error']

[Killed] StringLiteral
Code/metrics/src/index.ts:61:22
       this._numOfErrors = new this._client.Counter({
         name: 'numOfErrors',
         help: 'Number of errors',
-        labelNames: ['error']
+        labelNames: [""]
       })
     }

[Timeout] ArrayDeclaration
Code/metrics/src/index.ts:61:21
       this._numOfErrors = new this._client.Counter({
         name: 'numOfErrors',
         help: 'Number of errors',
-        labelNames: ['error']
+        labelNames: []
       })
     }

[Killed] BooleanLiteral
Code/metrics/src/index.ts:64:9
         labelNames: ['error']
       })
     }
-    if (!this._disableRouteCounter) {
+    if (this._disableRouteCounter) {
       this._numOfRequests = new this._client.Counter({
         name: 'numOfRequests',

[Killed] ConditionalExpression
Code/metrics/src/index.ts:64:9
         labelNames: ['error']
       })
     }
-    if (!this._disableRouteCounter) {
+    if (true) {
       this._numOfRequests = new this._client.Counter({
         name: 'numOfRequests',

[Timeout] ObjectLiteral
Code/metrics/src/index.ts:65:54
       })
     }
     if (!this._disableRouteCounter) {
-      this._numOfRequests = new this._client.Counter({
-        name: 'numOfRequests',
-        help: 'Number of requests made to a route',
-        labelNames: ['route']
-      })
+      this._numOfRequests = new this._client.Counter({})
     }
     if (!this._disableDurationCounter) {

[Killed] StringLiteral
Code/metrics/src/index.ts:66:15
     }
     if (!this._disableRouteCounter) {
       this._numOfRequests = new this._client.Counter({
-        name: 'numOfRequests',
+        name: "",
         help: 'Number of requests made to a route',
         labelNames: ['route']

[Killed] StringLiteral
Code/metrics/src/index.ts:67:15
     if (!this._disableRouteCounter) {
       this._numOfRequests = new this._client.Counter({
         name: 'numOfRequests',
-        help: 'Number of requests made to a route',
+        help: "",
         labelNames: ['route']
       })

[Killed] StringLiteral
Code/metrics/src/index.ts:68:22
       this._numOfRequests = new this._client.Counter({
         name: 'numOfRequests',
         help: 'Number of requests made to a route',
-        labelNames: ['route']
+        labelNames: [""]
       })
     }

[Killed] ConditionalExpression
Code/metrics/src/index.ts:71:9
         labelNames: ['route']
       })
     }
-    if (!this._disableDurationCounter) {
+    if (false) {
       this._httpRequestDurationMicroseconds = new this._client.Histogram({
         name: 'http_request_duration_ms',

[Killed] ConditionalExpression
Code/metrics/src/index.ts:71:9
         labelNames: ['route']
       })
     }
-    if (!this._disableDurationCounter) {
+    if (true) {
       this._httpRequestDurationMicroseconds = new this._client.Histogram({
         name: 'http_request_duration_ms',

[Timeout] ObjectLiteral
Code/metrics/src/index.ts:72:74
       })
     }
     if (!this._disableDurationCounter) {
-      this._httpRequestDurationMicroseconds = new this._client.Histogram({
-        name: 'http_request_duration_ms',
-        help: 'Duration of HTTP requests in ms',
-        labelNames: ['method', 'route', 'code'],
-        buckets: [0.10, 5, 15, 50, 100, 200, 300, 400, 500]
-      })
+      this._httpRequestDurationMicroseconds = new this._client.Histogram({})
     }
   }

[Killed] StringLiteral
Code/metrics/src/index.ts:75:41
       this._httpRequestDurationMicroseconds = new this._client.Histogram({
         name: 'http_request_duration_ms',
         help: 'Duration of HTTP requests in ms',
-        labelNames: ['method', 'route', 'code'],
+        labelNames: ['method', 'route', ""],
         buckets: [0.10, 5, 15, 50, 100, 200, 300, 400, 500]
       })

[Timeout] ArrayDeclaration
Code/metrics/src/index.ts:76:18
         name: 'http_request_duration_ms',
         help: 'Duration of HTTP requests in ms',
         labelNames: ['method', 'route', 'code'],
-        buckets: [0.10, 5, 15, 50, 100, 200, 300, 400, 500]
+        buckets: []
       })
     }

[Timeout] BlockStatement
Code/metrics/src/index.ts:81:103
     }
   }
 
-  public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {
-    res.locals.startEpoch = Date.now()
-    res.on('finish', () => {
-      if (!this._ignore.includes(req.originalUrl)) {
-        const responseTimeInMs = Date.now() - res.locals.startEpoch
-        if (!this._disableDurationCounter) {
-          this._httpRequestDurationMicroseconds
-            .labels(req.method, req.originalUrl, res.statusCode.toString())
-            .observe(responseTimeInMs)
-        }
-        if (!this._disableRouteCounter) {
-          this._numOfRequests.inc({ route: req.originalUrl })
-        }
-        if (res.statusCode >= 400) {
-          if (!this._disableErrorCounter) {
-            this._numOfErrors.inc({ error: res.statusCode })
-          }
-        }
-      }
-    })
-    next()
-  }
+  public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {}
 
   public endpoint = (req: express.Request, res: express.Response): void => {

[Timeout] BlockStatement
Code/metrics/src/index.ts:83:28
 
   public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {
     res.locals.startEpoch = Date.now()
-    res.on('finish', () => {
-      if (!this._ignore.includes(req.originalUrl)) {
-        const responseTimeInMs = Date.now() - res.locals.startEpoch
-        if (!this._disableDurationCounter) {
-          this._httpRequestDurationMicroseconds
-            .labels(req.method, req.originalUrl, res.statusCode.toString())
-            .observe(responseTimeInMs)
-        }
-        if (!this._disableRouteCounter) {
-          this._numOfRequests.inc({ route: req.originalUrl })
-        }
-        if (res.statusCode >= 400) {
-          if (!this._disableErrorCounter) {
-            this._numOfErrors.inc({ error: res.statusCode })
-          }
-        }
-      }
-    })
+    res.on('finish', () => {})
     next()
   }

[Survived] StringLiteral
Code/metrics/src/index.ts:83:12
 
   public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {
     res.locals.startEpoch = Date.now()
-    res.on('finish', () => {
+    res.on("", () => {
       if (!this._ignore.includes(req.originalUrl)) {
         const responseTimeInMs = Date.now() - res.locals.startEpoch

[Killed] ConditionalExpression
Code/metrics/src/index.ts:84:11
   public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {
     res.locals.startEpoch = Date.now()
     res.on('finish', () => {
-      if (!this._ignore.includes(req.originalUrl)) {
+      if (false) {
         const responseTimeInMs = Date.now() - res.locals.startEpoch
         if (!this._disableDurationCounter) {

[Survived] ConditionalExpression
Code/metrics/src/index.ts:84:11
   public collect = (req: express.Request, res: express.Response, next: express.NextFunction): void => {
     res.locals.startEpoch = Date.now()
     res.on('finish', () => {
-      if (!this._ignore.includes(req.originalUrl)) {
+      if (true) {
         const responseTimeInMs = Date.now() - res.locals.startEpoch
         if (!this._disableDurationCounter) {

[Survived] ArithmeticOperator
Code/metrics/src/index.ts:85:45
     res.locals.startEpoch = Date.now()
     res.on('finish', () => {
       if (!this._ignore.includes(req.originalUrl)) {
-        const responseTimeInMs = Date.now() - res.locals.startEpoch
+        const responseTimeInMs = Date.now() + res.locals.startEpoch
         if (!this._disableDurationCounter) {
           this._httpRequestDurationMicroseconds

[Killed] BlockStatement
Code/metrics/src/index.ts:86:44
     res.on('finish', () => {
       if (!this._ignore.includes(req.originalUrl)) {
         const responseTimeInMs = Date.now() - res.locals.startEpoch
-        if (!this._disableDurationCounter) {
-          this._httpRequestDurationMicroseconds
-            .labels(req.method, req.originalUrl, res.statusCode.toString())
-            .observe(responseTimeInMs)
-        }
+        if (!this._disableDurationCounter) {}
         if (!this._disableRouteCounter) {
           this._numOfRequests.inc({ route: req.originalUrl })

[Killed] ConditionalExpression
Code/metrics/src/index.ts:86:13
     res.on('finish', () => {
       if (!this._ignore.includes(req.originalUrl)) {
         const responseTimeInMs = Date.now() - res.locals.startEpoch
-        if (!this._disableDurationCounter) {
+        if (false) {
           this._httpRequestDurationMicroseconds
             .labels(req.method, req.originalUrl, res.statusCode.toString())

[Killed] ConditionalExpression
Code/metrics/src/index.ts:91:13
             .labels(req.method, req.originalUrl, res.statusCode.toString())
             .observe(responseTimeInMs)
         }
-        if (!this._disableRouteCounter) {
+        if (false) {
           this._numOfRequests.inc({ route: req.originalUrl })
         }

[Killed] EqualityOperator
Code/metrics/src/index.ts:94:28
         if (!this._disableRouteCounter) {
           this._numOfRequests.inc({ route: req.originalUrl })
         }
-        if (res.statusCode >= 400) {
+        if (res.statusCode > 400) {
           if (!this._disableErrorCounter) {
             this._numOfErrors.inc({ error: res.statusCode })

[Killed] BlockStatement
Code/metrics/src/index.ts:94:36
         if (!this._disableRouteCounter) {
           this._numOfRequests.inc({ route: req.originalUrl })
         }
-        if (res.statusCode >= 400) {
-          if (!this._disableErrorCounter) {
-            this._numOfErrors.inc({ error: res.statusCode })
-          }
-        }
+        if (res.statusCode >= 400) {}
       }
     })

[Killed] BooleanLiteral
Code/metrics/src/index.ts:95:15
           this._numOfRequests.inc({ route: req.originalUrl })
         }
         if (res.statusCode >= 400) {
-          if (!this._disableErrorCounter) {
+          if (this._disableErrorCounter) {
             this._numOfErrors.inc({ error: res.statusCode })
           }

[Killed] BlockStatement
Code/metrics/src/index.ts:95:43
           this._numOfRequests.inc({ route: req.originalUrl })
         }
         if (res.statusCode >= 400) {
-          if (!this._disableErrorCounter) {
-            this._numOfErrors.inc({ error: res.statusCode })
-          }
+          if (!this._disableErrorCounter) {}
         }
       }

[Killed] BlockStatement
Code/metrics/src/index.ts:104:76
     next()
   }
 
-  public endpoint = (req: express.Request, res: express.Response): void => {
-    if (!this._disableDefaultMetrics) {
-      this._client._collectDefaultMetrics()
-    }
-    res.set('Content-Type', this._client.register.contentType)
-    res.status(200)
-    res.end(this._client.register.metrics())
-  }
+  public endpoint = (req: express.Request, res: express.Response): void => {}
 }
 export default Metrics

[Killed] BooleanLiteral
Code/metrics/src/index.ts:105:9
   }
 
   public endpoint = (req: express.Request, res: express.Response): void => {
-    if (!this._disableDefaultMetrics) {
+    if (this._disableDefaultMetrics) {
       this._client._collectDefaultMetrics()
     }

[Killed] ConditionalExpression
Code/metrics/src/index.ts:105:9
   }
 
   public endpoint = (req: express.Request, res: express.Response): void => {
-    if (!this._disableDefaultMetrics) {
+    if (true) {
       this._client._collectDefaultMetrics()
     }

[Killed] StringLiteral
Code/metrics/src/index.ts:108:13
     if (!this._disableDefaultMetrics) {
       this._client._collectDefaultMetrics()
     }
-    res.set('Content-Type', this._client.register.contentType)
+    res.set("", this._client.register.contentType)
     res.status(200)
     res.end(this._client.register.metrics())
